content-org/santiyounger-website.org
#+HUGO_BASE_DIR:~/hugo/santiyounger-website
#+hugo_weight: auto
* TODO 60-Minute Consulting On Your Project
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: posts
  :EXPORT_FILE_NAME: consulting
  :END:
If you want to [[*Let's Do It][schedule an hour]] to discuss your projects and ideas I'd love to be of service.

- Productivity Systems
- Business Ideas
- Content Creation Advice

  # this is inspired from  https://joelhooks.com/consult
** Specific Topics
I am a Jack of Trades, with a holistic mixture of interests, ranging from practical philosophy to computer nerdy stuff.

 If you've found my website thanks to a very specific interest, then I can help you with that too.

*Some Examples Are:*
- Note-Taking Systems
- Web-Design
- Being a Successful Jack of All Trades

** Frequently Asked Questions
**** I'd Love To Hire You, But I Don't Have To Time To Schedule A Call?
I get you, our lives get busier and busier, part of what I can help you with is develop strategies to use your time more efficiently, so that you can free your time to achieve your goals.

If you'd like to hire me, but don't have time for a video call, then reach out to me, *we can plan an email based consulting method that fits with your schedule.*
**** What Types of Topics Will We Cover?
My objective is to help you achieve your goals, we'll talk about the problems you'd like to solve for your own projects. 

Where I can contribute most is in providing ideas, resources, tools and the mindset needed to help you create a system that will allow you to go where you want to go.   

**** Who is This For?
I love to work with creative people with all types of interesting projects. 

I particularly love working with other Jacks of All Trades, people who have ideas for several side projects, or want to find a way to make several projects work all at once.    

** Let's Do It
   :PROPERTIES:
   :CUSTOM_ID: consulting-form-200808
   :END:
  
*Just Send Me A Message Explaining What I can Help You With* 

After reading your application. I'll provide scheduling options and custom pricing depending on your particular needs.

  {{< contact-form >}}
  
